SE4Foam/tutorials/valids/turbulent/fr_Petukhov/Re1e4_kOmega/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.51;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2.51;//omega=Cmu^-0.25*k^(0.5)/l, l=0.038*d
    }
    outlet
    {
        type            zeroGradient;
    }
    tubeWall
    {
        type            omegaWallFunction;
        value           uniform 2.51;
    }
}


// ************************************************************************* //
