SE4Foam/tutorials/valids/turbulent/fr_Petukhov/Re1e4_kOmega/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  SE4Foam;

Prt		Prt [ 0 0 0 0 0 0 0 ]		0.85;
Pr              Pr [0 0 0 0 0 0 0]		5.82;

fluidConstProp    constProp    coeffs    18.015    996.5    0.6105    4181.0    8.5e-4;// nu = 8.53e-7, alpha = 1.465e-7, Pr = 5.82

//transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 8.53e-7;
// ************************************************************************* //
